var questions = [{
  title: '你认为恋爱作为人生一个极其重要的环节，其最终所达到的目的应当是',
  options: ['找到一个情投意合的伴侣',
  '成家过日子，抚育子女',
  '满足性的饥渴',
  '只是觉得新鲜有趣，没有明确的想法'
]
},{
  title: '如果你是位先生/女士，你对未来妻子/丈夫首先考虑的是',
  options: ['善于持家，利落能干/潇洒大方，有男子气概',
  '容貌漂亮，气质高雅/有钱有势，社交能力强',
  '人品不错，能体贴帮助自己/为人诚实正直，有进取心、待人和蔼可亲',
  '只要爱，其他一切无所谓/只要他爱我，其他不考虑'
]
},{
  title: '你决定和对方建立恋爱关系时所依据的心理根据是',
  options: ['彼此各有想法，但大体相互尊重',
  '我比对方优越',
  '对方比我优越',
  '没想过'
]
},{
  title: '你对最佳恋爱时间的考虑是',
  options: ['自己已经成熟，懂得了人生的意义和爱情的内涵，并且确定了事业上的主要方向',
  '随着年龄的增长，自有贤妻和佳婿相伴，“月老”不会忘记任何人',
  '先下手为强，越早主动越好',
  '还没想过'
]
},{
  title: '你希望自己怎样结识恋人',
  options: ['青梅竹马，情深意长',
  '一见钟情，难舍难分',
  '在工作和学习中逐渐产生恋情',
  '经熟人介绍'
]
},{
  title: '你认为增进爱情的良策是',
  options: ['极力讨好取悦对方',
  '尽力使自己变得更完美',
  '百依百顺，言听计从',
  '无计可施'
]
},{
  title: '人们通常认为，恋爱过程是个相互了解、相互适应和培养感情的过程，但了解、适应就需要花时间。那么，你希望恋爱的时间是',
  options: ['越短越好，最好是“闪电式”',
  '时间依进展而定',
  '时间要拖长些',
  '自己无主张，完全听对方的'
]
},{
  title: '谁都希望完整全面地了解对方，你觉得了解他（她）的最佳途径是',
  options: ['精心安排特殊场面，不断对恋人进行考验',
  '坦诚地交谈，细心地观察',
  '通过朋友打听',
  '没想过'
]
},{
  title: '你十分倾心你的恋人，但经过一段时间的交往后，发现对方的一些缺点，这时你',
  options: ['采用婉转的方式告知对方并帮助对方改进',
  '因出乎意料而伤脑筋',
  '嫌弃对方，犹豫动摇',
  '不知道如何是好'
]
},{
  title: '当你已在爱河之中，一位条件更好的异性对你表示爱慕时，你会',
  options: ['说明事情，忠实于恋人',
  '对其冷淡，但维持友谊',
  '瞒着恋人与其交往',
  '感到茫然无措'
]
},{
  title: '当你对爱慕已久的异性有好感时，你忽然发现他/她另有所爱，你会',
  options: ['静观其变，进退自如',
  '参与角逐，继续穷追',
  '抽身止步，成人之美',
  '不知道'
]
},
// index 11
{
  title: '如果给你一个生鸡蛋，你会选择放在哪个地方？',
  options: ['自己的口袋里',
  '高高的大树上',
  '流动的河水里',
  '路边的花坛中'
]
},{
  title: '恋爱过程很少会一帆风顺，当恋爱中出现矛盾、波折时，你感到',
  options: ['既然已经出现，也是件好事，双方正好趁此了解和考验对方',
  '伤心难过，认为这是不对的',
  '疑虑顿生，就此提出分手',
  '束手无策'
]
},{
  title: '由于性情不合或其他原因，你的恋爱搁浅了，对方提出分手。这时你会',
  options: ['千方百计缠住对方',
  '到处诋毁对方名誉',
  '说声再见，各奔前程',
    '不知所措'
  ]
},{
  title: '当你十分信赖的恋人背信弃义、喜新厌旧、甩掉你以后，你会',
  options: ['只当自己眼瞎，认错了人',
  '既然他不仁，休怪我不义',
  '吸取教训，重新开始',
  '痛苦得难以自拔'
]
},{
  title: '你的爱情路途坎坷，多次恋爱均告失败，随着年龄增长进入“男大当婚，女大当嫁”的行列，你会',
  options: ['一如从前，宁缺毋滥',
  '厌弃追求，随便凑合一个',
  '检查自己的择偶标准是否实际',
  '叹息命运不佳，从此绝望'
]
}]
var results = 
[{
  content:'专一：你是一个对感情十分专一的人，认定自己可以永远拥有，并且希望对方是你的唯一。',
  photoSrc: '../../resourse/result0.JPEG'
},
{
  content:'眼光高：你是一个控制欲比较强的人，希望对方迁就你，以你为中心，你也比较有自信。',
  photoSrc: '../../resourse/result1.JPEG'
},{
  content:'花心：在这种情况下你的感情是飘忽不定的，原因可能来源于自己，没有把握好分寸。',
  photoSrc: '../../resourse/result2.JPEG'
},{
  content:'随缘：你对这份感情看得很淡情，至少并不是你的最喜欢的。你可以接受随时失去，也可以逐渐忘记。',
  photoSrc: '../../resourse/result3.JPEG'
},]
export  {questions, results}